ChartsOfCharacteristicTypes/ХарактеристикиПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ХарактеристикиПерсонала</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ЗначенияХарактеристикПерсонала</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>10</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>10</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидХарактеристики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыХарактеристикПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Comment>Помещено в архив</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОценку360</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭлектронноеИнтервью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭлектронноеТестирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭкспертнуюОценку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииХарактеристикПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШкалаЗначений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШкалыЗначенийХарактеристикПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыбораОтветаВОпросахПоКомпетенциям</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыбораОтветовВОпросахПоКомпетенциям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВМатрицеТалантов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

InformationRegisters/ВопросыОценкиХарактеристикПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВопросыОценкиХарактеристикПерсонала</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаПерсонала</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиОбученияРазвития.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбученияРазвития</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьОбучениеРазвитиеСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПубликацииМероприятийОбученияРазвития</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьУченическиеДоговоры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЦелиРазвитияСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПрогрессОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродолжительностьПрогрессаОбучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерностьПродолжительностиПрогрессаОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/МероприятияОценкиПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МероприятияОценкиПерсонала</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполненияРеспондентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособЗаполненияРеспондентовВОценке360</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииРеспонденты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииСотрудники</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьВопросыКомпетенций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомпетенцииПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВопросыХарактеристик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаПерсонала</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеОпроса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеспондентыЕдиныйНабор</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Респондент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольРеспондента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиРеспондентаОценкиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Респонденты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Респондент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольРеспондента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиРеспондентаОценкиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДействияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДействияСотрудников</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПроверка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ChartsOfCharacteristicTypes/ХарактеристикиПерсонала/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияХарактеристикПерсонала");
		ПриПолученииДанныхНаСервере(Параметры.ЗначениеКопирования);
	КонецЕсли;
	
	СписокМероприятий.Параметры.УстановитьЗначениеПараметра("Характеристика", Объект.Ссылка);
	УстановитьЗаголовокСпискаМероприятий();
	
	ОбновитьСоставЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	ПрежнееПолноеНаименование = Объект.ПолноеНаименование;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьВопросыОценкиХарактеристик(ТекущийОбъект);
	ЗначенияШкалы = ЗначенияШкалы(ТекущийОбъект.ШкалаЗначений);
	ЗаписатьФункции(ТекущийОбъект, ЗначенияШкалы);
	ЗаписатьКомпетенции(ТекущийОбъект, ЗначенияШкалы);
	ЗаписатьГруппы(ТекущийОбъект, ЗначенияШкалы);
	
	Если ИзменениеЦелейРазвития Тогда
		ЗаписатьЦелиРазвития(ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
	ОбновитьСоставЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Для Каждого ТекущееЗначение Из ИзмененныеЗначения Цикл
		ОтобразитьИзменениеДанных(ТекущееЗначение.Значение, ВидИзмененияДанных.Изменение);
	КонецЦикла;
	ИзмененныеЗначения.Очистить();
	
	Оповестить("ЗаписьХарактеристикиПерсонала",,Объект.Ссылка);
	
	Если ПараметрыЗаписи.Свойство("ЗаписатьИЗакрыть") Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьПоИсточнику();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШкалаЗначенийПриИзменении(Элемент)
	
	ЗаполнитьНадписьЗначенияШкалы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОценку360ПриИзменении(Элемент)
	
	УстановитьДоступностьПоведенческихИндикаторов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЭкспертнуюОценкуПриИзменении(Элемент)
	
	УстановитьДоступностьСпособаВыбораОтвета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолноеНаименованиеПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Или НаименованиеСоответствуетПрежнему() Тогда
		Объект.Наименование = НаименованиеПоПолномуНаименованию(Объект.ПолноеНаименование);
	КонецЕсли;
	
	ПрежнееПолноеНаименование = Объект.ПолноеНаименование;
	
	НастроитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НастроитьЭлементыФормы(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначения

&НаКлиенте
Процедура ЗначенияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Значения.ТекущиеДанные;
	ТекущиеДанные.ПометкаУдаления = Ложь;
	ТекущиеДанные.ИндексКартинки = ИндексКартинкиЭлемента();
	
	Если Копирование Тогда
		ТекущиеДанные.Ссылка = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Значения.ТекущиеДанные;
	ТекущиеДанные.ПометкаУдаления = НЕ ТекущиеДанные.ПометкаУдаления;	
	ТекущиеДанные.ИндексКартинки = ?(ТекущиеДанные.ПометкаУдаления,
		ИндексКартинкиЭлементаПометкаУдаления(), ИндексКартинкиЭлемента());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВопросы

&НаКлиенте
Процедура ВопросыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Вопросы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ВопросОкончаниеВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Вопрос);
	ПараметрыФормы.Вставить("ХарактеристикаПерсонала", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.МероприятияОценкиПерсонала.Форма.НастройкаВопросовДляАнкетирования",
		ПараметрыФормы, ЭтотОбъект,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(
		Вопросы, ВыбранноеЗначение, "Вопрос");
	
	УстановитьЗаголовокГруппы(Вопросы, КоличествоПоведенческихИндикаторов);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	НачатьПодборВопросов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПриИзменении(Элемент)
	УстановитьЗаголовокГруппы(Вопросы, КоличествоПоведенческихИндикаторов); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФункции

&НаКлиенте
Процедура ФункцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Функции.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ФункцияОкончаниеВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Функция);
	
	ОткрытьФорму("Справочник.ДействияСотрудников.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ФункцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(
		Функции, ВыбранноеЗначение, "Функция");
	
	УстановитьЗаголовокГруппы(Функции, КоличествоФункций);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ФункцииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	НачатьПодборФункций();
	
КонецПроцедуры

&НаКлиенте
Процедура ФункцииПриИзменении(Элемент)
	УстановитьЗаголовокГруппы(Функции, КоличествоФункций);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпетенции

&НаКлиенте
Процедура КомпетенцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Компетенции.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("КомпетенцияОкончаниеВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Компетенция);
	
	ОткрытьФорму("Справочник.КомпетенцииПерсонала.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпетенцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(
		Компетенции, ВыбранноеЗначение, "Компетенция");
	
	УстановитьЗаголовокГруппы(Компетенции, КоличествоКомпетенций);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпетенцииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	НачатьПодборКомпетенций();
	
КонецПроцедуры

&НаКлиенте
Процедура КомпетенцииПриИзменении(Элемент)
	УстановитьЗаголовокГруппы(Компетенции, КоличествоКомпетенций);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГруппы

&НаКлиенте
Процедура ГруппыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Группы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ГруппаОкончаниеВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Группа);
	
	ОткрытьФорму("Справочник.ГруппыХарактеристикПерсонала.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(
		Группы, ВыбранноеЗначение, "Группа");
	
	УстановитьЗаголовокГруппы(Группы, КоличествоГрупп);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	НачатьПодборГруппХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПриИзменении(Элемент)
	УстановитьЗаголовокГруппы(Группы, КоличествоГрупп);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЦелиРазвития

&НаКлиенте
Процедура ЦелиРазвитияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЦелиРазвития.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ЦелиРазвитияОкончаниеВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Цель);
	
	ОткрытьФорму("Справочник.ЦелиРазвития.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦелиРазвитияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(
		ЦелиРазвития, ВыбранноеЗначение, "Цель");
	
	УстановитьЗаголовокГруппы(ЦелиРазвития, КоличествоЦелей);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦелиРазвитияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	НачатьПодборЦелейРазвития();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦелиРазвитияПриИзменении(Элемент)
	УстановитьЗаголовокГруппы(ЦелиРазвития, КоличествоЦелей);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокМероприятий

&НаКлиенте
Процедура СписокМероприятийПриИзменении(Элемент)
	УстановитьЗаголовокСпискаМероприятий();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьПомеченныеНаУдаление(Команда)
	
	Элементы.ФормаПоказыватьПомеченныеНаУдаление.Пометка = Не Элементы.ФормаПоказыватьПомеченныеНаУдаление.Пометка;
	Если Элементы.ФормаПоказыватьПомеченныеНаУдаление.Пометка Тогда
		Элементы.Значения.ОтборСтрок = Новый ФиксированнаяСтруктура;
	Иначе
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("ПометкаУдаления", Ложь);
		Элементы.Значения.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборВопросов(Команда)
	
	НачатьПодборВопросов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборФункций(Команда)
	
	НачатьПодборФункций();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКомпетенций(Команда)
	
	НачатьПодборКомпетенций();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборГрупп(Команда)
	
	НачатьПодборГруппХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЦелейРазвития(Команда)
	
	НачатьПодборЦелейРазвития();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Записать(Новый Структура("ЗаписатьИЗакрыть"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект)
	
	ДоступныВопросы = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ВопросыОценкиХарактеристикПерсонала);
	
	ИспользуетсяОценка360 = ПолучитьФункциональнуюОпцию("ИспользоватьОценкуПерсонала");
	ИспользуетсяЭлектронноеИнтервью = ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеИнтервью");
	ИспользуетсяЭлектронноеТестирование = ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеТестированиеКандидатов");
	ИспользуетсяЭкспертнаяОценка = ПолучитьФункциональнуюОпцию("ИспользоватьЭкспертнуюОценкуПерсонала");
	
	ЗаполнитьСписокВопросов(ТекущийОбъект);
	ЗаполнитьФункции(ТекущийОбъект);
	ЗаполнитьКомпетенции(ТекущийОбъект);
	ЗаполнитьГруппыХарактеристик(ТекущийОбъект);
	
	УстановитьВидимостьДоступностьЦелейРазвития(ТекущийОбъект);
	УстановитьЗаголовкиГрупп();
	УстановитьВидимостьИнструментовОценки();
	УстановитьДоступностьПоведенческихИндикаторов(ЭтотОбъект);
	ЗаполнитьНадписьЗначенияШкалы();
	УстановитьДоступностьСпособаВыбораОтвета(ЭтотОбъект);
	
	НастроитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВопросов(ТекущийОбъект)

	Если Не ДоступныВопросы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		Возврат;
	КонецЕсли; 
	
	Вопросы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВопросыОценкиХарактеристикПерсонала.Вопрос КАК Вопрос
		|ИЗ
		|	РегистрСведений.ВопросыОценкиХарактеристикПерсонала КАК ВопросыОценкиХарактеристикПерсонала
		|ГДЕ
		|	ВопросыОценкиХарактеристикПерсонала.ХарактеристикаПерсонала = &ХарактеристикаПерсонала";
	
	Запрос.УстановитьПараметр("ХарактеристикаПерсонала", ТекущийОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Вопросы.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьВопросыОценкиХарактеристик(ТекущийОбъект)

	Если Не ДоступныВопросы Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейВопросыОценкиХарактеристик = РегистрыСведений.ВопросыОценкиХарактеристикПерсонала.СоздатьНаборЗаписей();
	
	НаборЗаписейВопросыОценкиХарактеристик.Отбор.ХарактеристикаПерсонала.Установить(ТекущийОбъект.Ссылка);
	Если ТекущийОбъект.ИспользоватьОценку360 Тогда
		Для Каждого Вопрос Из Вопросы Цикл
			НоваяЗаписьНабора = НаборЗаписейВопросыОценкиХарактеристик.Добавить();
			НоваяЗаписьНабора.ХарактеристикаПерсонала = ТекущийОбъект.Ссылка;
			ЗаполнитьЗначенияСвойств(НоваяЗаписьНабора, Вопрос);
		КонецЦикла;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписейВопросыОценкиХарактеристик.Записать(Истина);

КонецПроцедуры

&НаСервере
Процедура ЗаписатьФункции(ТекущийОбъект, ЗначенияШкалы)
	
	ДобавленныеФункции = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		Функции.Выгрузить().ВыгрузитьКолонку("Функция"),
		ФункцииПриЧтении.Выгрузить().ВыгрузитьКолонку("Функция"));
	УдаленныеФункции = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ФункцииПриЧтении.Выгрузить().ВыгрузитьКолонку("Функция"),
		Функции.Выгрузить().ВыгрузитьКолонку("Функция"));
	
	Для Каждого ДобавленнаяФункция Из ДобавленныеФункции Цикл
		ОбъектФункция = ДобавленнаяФункция.ПолучитьОбъект();
		ХарактеристикиФункции = ОбъектФункция.ХарактеристикиПерсонала;
		Если ЗначенияШкалы.Количество() = 0 Тогда
			НоваяХарактеристика = ХарактеристикиФункции.Добавить();
			НоваяХарактеристика.Характеристика = ТекущийОбъект.Ссылка;
			НоваяХарактеристика.Вес = 1;
		Иначе
			Для Каждого Значение Из ЗначенияШкалы Цикл
				НоваяХарактеристика = ХарактеристикиФункции.Добавить();
				НоваяХарактеристика.Характеристика = ТекущийОбъект.Ссылка;
				НоваяХарактеристика.Вес = 1;
				НоваяХарактеристика.Значение = Значение;
			КонецЦикла;
		КонецЕсли;
		ОбъектФункция.Записать();
	КонецЦикла;
	
	Для Каждого УдаленнаяФункция Из УдаленныеФункции Цикл
		ОбъектФункция = УдаленнаяФункция.ПолучитьОбъект();
		ХарактеристикиФункции = ОбъектФункция.ХарактеристикиПерсонала;
		НайденныеСтроки = ХарактеристикиФункции.НайтиСтроки(Новый Структура("Характеристика",ТекущийОбъект.Ссылка));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ХарактеристикиФункции.Удалить(НайденнаяСтрока);
		КонецЦикла;
		ОбъектФункция.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомпетенции(ТекущийОбъект, ЗначенияШкалы)
	
	ДобавленныеКомпетенции = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		Компетенции.Выгрузить().ВыгрузитьКолонку("Компетенция"),
		КомпетенцииПриЧтении.Выгрузить().ВыгрузитьКолонку("Компетенция"));
	УдаленныеКомпетенции = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		КомпетенцииПриЧтении.Выгрузить().ВыгрузитьКолонку("Компетенция"),
		Компетенции.Выгрузить().ВыгрузитьКолонку("Компетенция"));
	
	Для Каждого ДобавленнаяКомпетенция Из ДобавленныеКомпетенции Цикл
		ОбъектКомпетенция = ДобавленнаяКомпетенция.ПолучитьОбъект();
		ХарактеристикиКомпетенции = ОбъектКомпетенция.ХарактеристикиПерсонала;
		Если ЗначенияШкалы.Количество() = 0 Тогда
			НоваяХарактеристика = ХарактеристикиКомпетенции.Добавить();
			НоваяХарактеристика.Характеристика = ТекущийОбъект.Ссылка;
			НоваяХарактеристика.Вес = 1;
		Иначе
			Для Каждого Значение Из ЗначенияШкалы Цикл
				НоваяХарактеристика = ХарактеристикиКомпетенции.Добавить();
				НоваяХарактеристика.Характеристика = ТекущийОбъект.Ссылка;
				НоваяХарактеристика.Вес = 1;
				НоваяХарактеристика.Значение = Значение;
			КонецЦикла;
		КонецЕсли;
		ОбъектКомпетенция.Записать();
	КонецЦикла;
	
	Для Каждого УдаленнаяКомпетенция Из УдаленныеКомпетенции Цикл
		ОбъектКомпетенция = УдаленнаяКомпетенция.ПолучитьОбъект();
		ХарактеристикиКомпетенции = ОбъектКомпетенция.ХарактеристикиПерсонала;
		НайденныеСтроки = ХарактеристикиКомпетенции.НайтиСтроки(Новый Структура("Характеристика",ТекущийОбъект.Ссылка));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ХарактеристикиКомпетенции.Удалить(НайденнаяСтрока);
		КонецЦикла;
		ОбъектКомпетенция.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьГруппы(ТекущийОбъект, ЗначенияШкалы)
	
	ДобавленныеГруппы = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		Группы.Выгрузить().ВыгрузитьКолонку("Группа"),
		ГруппыПриЧтении.Выгрузить().ВыгрузитьКолонку("Группа"));
	УдаленныеГруппы = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ГруппыПриЧтении.Выгрузить().ВыгрузитьКолонку("Группа"),
		Группы.Выгрузить().ВыгрузитьКолонку("Группа"));
	
	Для Каждого ДобавленнаяГруппа Из ДобавленныеГруппы Цикл
		ОбъектГруппа = ДобавленнаяГруппа.ПолучитьОбъект();
		ХарактеристикиГруппы = ОбъектГруппа.ХарактеристикиПерсонала;
		Если ЗначенияШкалы.Количество() = 0 Тогда
			НоваяХарактеристика = ХарактеристикиГруппы.Добавить();
			НоваяХарактеристика.Характеристика = ТекущийОбъект.Ссылка;
			НоваяХарактеристика.Вес = 1;
		Иначе
			Для Каждого Значение Из ЗначенияШкалы Цикл
				НоваяХарактеристика = ХарактеристикиГруппы.Добавить();
				НоваяХарактеристика.Характеристика = ТекущийОбъект.Ссылка;
				НоваяХарактеристика.Вес = 1;
				НоваяХарактеристика.Значение = Значение;
			КонецЦикла;
		КонецЕсли;
		ОбъектГруппа.Записать();
	КонецЦикла;
	
	Для Каждого УдаленнаяГруппа Из УдаленныеГруппы Цикл
		ОбъектГруппа = УдаленнаяГруппа.ПолучитьОбъект();
		ХарактеристикиГруппы = ОбъектГруппа.ХарактеристикиПерсонала;
		НайденныеСтроки = ХарактеристикиГруппы.НайтиСтроки(Новый Структура("Характеристика",ТекущийОбъект.Ссылка));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ХарактеристикиГруппы.Удалить(НайденнаяСтрока);
		КонецЦикла;
		ОбъектГруппа.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЦелиРазвития(ТекущийОбъект)
	
	ДобавленныеЦели = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ЦелиРазвития.Выгрузить().ВыгрузитьКолонку("Цель"),
		ЦелиРазвитияПриЧтении.Выгрузить().ВыгрузитьКолонку("Цель"));
	УдаленныеЦели = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ЦелиРазвитияПриЧтении.Выгрузить().ВыгрузитьКолонку("Цель"),
		ЦелиРазвития.Выгрузить().ВыгрузитьКолонку("Цель"));
		
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("Справочник.ЦелиРазвития");
		Блокировка.Заблокировать();
		Для Каждого ДобавленнаяЦель Из ДобавленныеЦели Цикл
			ОбъектЦель = ДобавленнаяЦель.ПолучитьОбъект();
			ХарактеристикиЦели = ОбъектЦель.Характеристики;
			НоваяХарактеристика = ХарактеристикиЦели.Добавить();
			НоваяХарактеристика.Характеристика = ТекущийОбъект.Ссылка;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектЦель);
		КонецЦикла;
		
		Для Каждого УдаленнаяЦель Из УдаленныеЦели Цикл
			ОбъектЦель = УдаленнаяЦель.ПолучитьОбъект();
			ХарактеристикиЦели = ОбъектЦель.Характеристики;
			НайденныеСтроки = ХарактеристикиЦели.НайтиСтроки(Новый Структура("Характеристика", ТекущийОбъект.Ссылка));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ХарактеристикиЦели.Удалить(НайденнаяСтрока);
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектЦель);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Запись целей развития'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ЗначенияШкалы(ШкалаЗначений)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗначенияХарактеристик.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗначенияХарактеристик КАК ЗначенияХарактеристик
		|ГДЕ
		|	ЗначенияХарактеристик.ПометкаУдаления = ЛОЖЬ
		|	И ЗначенияХарактеристик.Владелец = &ШкалаЗначений
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначенияХарактеристик.РеквизитДопУпорядочивания";
	Запрос.УстановитьПараметр("ШкалаЗначений", ШкалаЗначений);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Процедура ОбновитьСоставЭлементовФормы(ТекстПредупреждения = "")
	
	Если Объект.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияХарактеристикПерсонала")) Тогда
		Элементы.ГруппаЗначения.Видимость = Истина;
	Иначе
		Элементы.ГруппаЗначения.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИндексКартинкиЭлемента()
	Возврат 3;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндексКартинкиЭлементаПометкаУдаления()
	Возврат 4;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЭлементыФормы(Форма)
	
	Если ЕстьЭлементыСНаименованием(Форма.Объект.Наименование, Форма.Объект.Ссылка) = Истина Тогда
		Форма.Элементы.ПредупреждениеОНаличииДублейНадпись.Видимость = Истина;
		Форма.Элементы.ПредупреждениеОНаличииДублейКартинка.Видимость = Истина;
	Иначе
		Форма.Элементы.ПредупреждениеОНаличииДублейНадпись.Видимость = Ложь;
		Форма.Элементы.ПредупреждениеОНаличииДублейКартинка.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НаименованиеПоПолномуНаименованию(ПолноеНаименование)
	Возврат Лев(ПолноеНаименование, 150)
КонецФункции

&НаКлиенте
Функция НаименованиеСоответствуетПрежнему()
	Возврат НаименованиеПоПолномуНаименованию(ПрежнееПолноеНаименование) = Объект.Наименование;
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьЭлементыСНаименованием(Наименование, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("ТекущийЭлемент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	ПланВидовХарактеристик.ХарактеристикиПерсонала КАК ХарактеристикиПерсонала
	|ГДЕ
	|	ХарактеристикиПерсонала.Наименование = &Наименование
	|	И ХарактеристикиПерсонала.Ссылка <> &ТекущийЭлемент";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьИнструментовОценки()
	
	Если Не ИспользуетсяОценка360 И Не ИспользуетсяЭлектронноеИнтервью
		И Не ИспользуетсяЭлектронноеТестирование И Не ИспользуетсяЭкспертнаяОценка Тогда
		Элементы.ИнструментыОценки.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаОценка360.Видимость = ИспользуетсяОценка360;
	Элементы.ИспользоватьЭлектронноеИнтервью.Видимость = ИспользуетсяЭлектронноеИнтервью;
	Элементы.ИспользоватьЭлектронноеТестирование.Видимость = ИспользуетсяЭлектронноеТестирование;
	Элементы.ИспользоватьЭкспертнуюОценку.Видимость = ИспользуетсяЭкспертнаяОценка;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиГрупп()
	
	УстановитьЗаголовокГруппы(Вопросы, КоличествоПоведенческихИндикаторов);
	УстановитьЗаголовокГруппы(Функции, КоличествоФункций);
	УстановитьЗаголовокГруппы(Компетенции, КоличествоКомпетенций);
	УстановитьЗаголовокГруппы(Группы, КоличествоГрупп);
	УстановитьЗаголовокГруппы(ЦелиРазвития, КоличествоЦелей);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокГруппы(ТаблицаФормы, ЗаголовокГруппы)
	
	КоличествоЭлементовВТаблицы = ТаблицаФормы.Количество();
	Если КоличествоЭлементовВТаблицы = 0 Тогда
		ЗаголовокГруппы = "";
	Иначе
		ЗаголовокГруппы = Формат(КоличествоЭлементовВТаблицы, "ЧГ=");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНадписьЗначенияШкалы()
	
	Если Не ЗначениеЗаполнено(Объект.ШкалаЗначений) Тогда
		Элементы.ЗначенияШкалы.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ЗначенияШкалы = ЗначенияШкалы(Объект.ШкалаЗначений);
	КоличествоЗначений = ЗначенияШкалы.Количество();
	
	Если КоличествоЗначений = 0 Тогда
		Элементы.ЗначенияШкалы.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ЗначенияШкалы.Видимость = Истина;
	Если КоличествоЗначений > 3 Тогда
		Надпись = СтрШаблон(НСтр("ru = 'Значения с %1 по %2'"),
			ЗначенияШкалы.Получить(0),
			ЗначенияШкалы.Получить(КоличествоЗначений - 1));
	Иначе
		Надпись = НСтр("ru = 'Значения:'") + Символы.НПП;
		Для Каждого ЗначениеШкалы Из ЗначенияШкалы Цикл
			Если ЗначенияШкалы.Найти(ЗначениеШкалы) + 1 = КоличествоЗначений Тогда
				Надпись = СтрШаблон(НСтр("ru = '%1%2'"), Надпись, ЗначениеШкалы);
			Иначе
				Надпись = СтрШаблон(НСтр("ru = '%1%2,%3'"), Надпись, ЗначениеШкалы, Символы.НПП);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Элементы.ЗначенияШкалы.Заголовок = Надпись;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФункции(ТекущийОбъект)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		Возврат;
	КонецЕсли; 
	
	Функции.Очистить();
	ФункцииПриЧтении.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействияСотрудниковХарактеристикиПерсонала.Ссылка КАК Функция
		|ИЗ
		|	Справочник.ДействияСотрудников.ХарактеристикиПерсонала КАК ДействияСотрудниковХарактеристикиПерсонала
		|ГДЕ
		|	ДействияСотрудниковХарактеристикиПерсонала.Характеристика = &Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ДействияСотрудниковХарактеристикиПерсонала.Ссылка";
	
	Запрос.УстановитьПараметр("Характеристика", ТекущийОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Функции.Добавить(), ВыборкаДетальныеЗаписи);
		Если ТекущийОбъект.Ссылка = Объект.Ссылка Тогда
			ЗаполнитьЗначенияСвойств(ФункцииПриЧтении.Добавить(), ВыборкаДетальныеЗаписи);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомпетенции(ТекущийОбъект)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		Возврат;
	КонецЕсли; 
	
	Компетенции.Очистить();
	КомпетенцииПриЧтении.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомпетенцииПерсоналаХарактеристикиПерсонала.Ссылка КАК Компетенция
		|ИЗ
		|	Справочник.КомпетенцииПерсонала.ХарактеристикиПерсонала КАК КомпетенцииПерсоналаХарактеристикиПерсонала
		|ГДЕ
		|	КомпетенцииПерсоналаХарактеристикиПерсонала.Характеристика = &Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	КомпетенцииПерсоналаХарактеристикиПерсонала.Ссылка";
	
	Запрос.УстановитьПараметр("Характеристика", ТекущийОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Компетенции.Добавить(), ВыборкаДетальныеЗаписи);
		Если ТекущийОбъект.Ссылка = Объект.Ссылка Тогда
			ЗаполнитьЗначенияСвойств(КомпетенцииПриЧтении.Добавить(), ВыборкаДетальныеЗаписи);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппыХарактеристик(ТекущийОбъект)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		Возврат;
	КонецЕсли; 
	
	Группы.Очистить();
	ГруппыПриЧтении.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыХарактеристикПерсоналаХарактеристикиПерсонала.Ссылка КАК Группа
		|ИЗ
		|	Справочник.ГруппыХарактеристикПерсонала.ХарактеристикиПерсонала КАК ГруппыХарактеристикПерсоналаХарактеристикиПерсонала
		|ГДЕ
		|	ГруппыХарактеристикПерсоналаХарактеристикиПерсонала.Характеристика = &Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ГруппыХарактеристикПерсоналаХарактеристикиПерсонала.Ссылка";
	
	Запрос.УстановитьПараметр("Характеристика", ТекущийОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Группы.Добавить(), ВыборкаДетальныеЗаписи);
		Если ТекущийОбъект.Ссылка = Объект.Ссылка Тогда
			ЗаполнитьЗначенияСвойств(ГруппыПриЧтении.Добавить(), ВыборкаДетальныеЗаписи);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦелиРазвития(ТекущийОбъект)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		Возврат;
	КонецЕсли; 
	
	ЦелиРазвития.Очистить();
	ЦелиРазвитияПриЧтении.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦелиРазвитияХарактеристики.Ссылка КАК Цель
		|ИЗ
		|	Справочник.ЦелиРазвития.Характеристики КАК ЦелиРазвитияХарактеристики
		|ГДЕ
		|	ЦелиРазвитияХарактеристики.Характеристика = &Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦелиРазвитияХарактеристики.Ссылка";
	
	Запрос.УстановитьПараметр("Характеристика", ТекущийОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЦелиРазвития.Добавить(), ВыборкаДетальныеЗаписи);
		Если ТекущийОбъект.Ссылка = Объект.Ссылка Тогда
			ЗаполнитьЗначенияСвойств(ЦелиРазвитияПриЧтении.Добавить(), ВыборкаДетальныеЗаписи);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура НачатьПодборВопросов()
	
	Если Не Параметры.Ключ.Пустая() Тогда
		ОткрытьПодборВопросов();
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Переход к поведенческим индикаторам возможен только после записи данных.
		|Данные будут записаны.'");
	
	Оповещение = Новый ОписаниеОповещения("ПодборВопросовПослеОтветаНаПредложениеЗаписать", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодборФункций()
	
	Если Не Параметры.Ключ.Пустая() Тогда
		ОткрытьПодборФункций();
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Переход к функциям возможен только после записи данных.
		|Данные будут записаны.'");
	
	Оповещение = Новый ОписаниеОповещения("ПодборФункцийПослеОтветаНаПредложениеЗаписать", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодборКомпетенций()
	
	Если Не Параметры.Ключ.Пустая() Тогда
		ОткрытьПодборКомпетенций();
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Переход к компетенциям возможен только после записи данных.
		|Данные будут записаны.'");
	
	Оповещение = Новый ОписаниеОповещения("ПодборКомпетенцийПослеОтветаНаПредложениеЗаписать", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодборГруппХарактеристик()
	
	Если Не Параметры.Ключ.Пустая() Тогда
		ОткрытьПодборГрупп();
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Переход к группам характеристик возможен только после записи данных.
		|Данные будут записаны.'");
	
	Оповещение = Новый ОписаниеОповещения("ПодборГруппПослеОтветаНаПредложениеЗаписать", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодборЦелейРазвития()
	
	Если Не Параметры.Ключ.Пустая() Тогда
		ОткрытьПодборЦелейРазвития();
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Переход к целям развития возможен только после записи данных.
		|Данные будут записаны.'");
	
	Оповещение = Новый ОписаниеОповещения("ПодборЦелейРазвитияПослеОтветаНаПредложениеЗаписать", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборВопросов()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ХарактеристикаПерсонала", Объект.Ссылка);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("АдресПодобранных", АдресПодобранныхВопросов());
	
	ОткрытьФорму("Справочник.МероприятияОценкиПерсонала.Форма.СписокВопросовДляАнкетирования", ПараметрыФормы, Элементы.Вопросы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборФункций()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ХарактеристикаПерсонала", Объект.Ссылка);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("АдресПодобранных", АдресПодобранныхФункций());
	
	ОткрытьФорму("Справочник.ДействияСотрудников.Форма.ФормаСписка", ПараметрыФормы, Элементы.Функции);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборКомпетенций()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ХарактеристикаПерсонала", Объект.Ссылка);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("АдресПодобранных", АдресПодобранныхКомпетенций());
	
	ОткрытьФорму("Справочник.КомпетенцииПерсонала.Форма.ФормаСписка", ПараметрыФормы, Элементы.Компетенции);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборГрупп()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ХарактеристикаПерсонала", Объект.Ссылка);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("АдресПодобранных", АдресПодобранныхГрупп());
	
	ОткрытьФорму("Справочник.ГруппыХарактеристикПерсонала.Форма.ФормаСписка", ПараметрыФормы, Элементы.Группы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборЦелейРазвития()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ХарактеристикаПерсонала", Объект.Ссылка);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("АдресСпискаПодобранныхЦелей", АдресПодобранныхЦелейРазвития());
	
	ОткрытьФорму("Справочник.ЦелиРазвития.Форма.ФормаСписка", ПараметрыФормы, Элементы.ЦелиРазвития);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборВопросовПослеОтветаНаПредложениеЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПодборВопросов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборФункцийПослеОтветаНаПредложениеЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПодборФункций();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКомпетенцийПослеОтветаНаПредложениеЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПодборКомпетенций();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборГруппПослеОтветаНаПредложениеЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПодборГрупп();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЦелейРазвитияПослеОтветаНаПредложениеЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПодборЦелейРазвития();
	
КонецПроцедуры

&НаСервере
Функция АдресПодобранныхВопросов()
	Возврат ПоместитьВоВременноеХранилище(Вопросы.Выгрузить().ВыгрузитьКолонку("Вопрос"));
КонецФункции

&НаСервере
Функция АдресПодобранныхФункций()
	Возврат ПоместитьВоВременноеХранилище(Функции.Выгрузить().ВыгрузитьКолонку("Функция"));
КонецФункции

&НаСервере
Функция АдресПодобранныхКомпетенций()
	Возврат ПоместитьВоВременноеХранилище(Компетенции.Выгрузить().ВыгрузитьКолонку("Компетенция"));
КонецФункции

&НаСервере
Функция АдресПодобранныхГрупп()
	Возврат ПоместитьВоВременноеХранилище(Группы.Выгрузить().ВыгрузитьКолонку("Группа"));
КонецФункции

&НаСервере
Функция АдресПодобранныхЦелейРазвития()
	Возврат ПоместитьВоВременноеХранилище(ЦелиРазвития.Выгрузить().ВыгрузитьКолонку("Цель"));
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьПоведенческихИндикаторов(Форма)
	Форма.Элементы.ВопросыГруппа.Доступность = Форма.Объект.ИспользоватьОценку360;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСпособаВыбораОтвета (Форма)
	Форма.Элементы.СпособВыбораОтветаВОпросахПоКомпетенциям.Доступность = Форма.Объект.ИспользоватьЭкспертнуюОценку;
КонецПроцедуры

&НаКлиенте
Процедура ВопросОкончаниеВыбора(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Вопросы.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ФункцияОкончаниеВыбора(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Функции.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура КомпетенцияОкончаниеВыбора(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Компетенции.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОкончаниеВыбора(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Группы.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЦелиРазвитияОкончаниеВыбора(Результат, ДополнительныеПараметры) Экспорт
	Элементы.ЦелиРазвития.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПоИсточнику()
	
	ИсточникВызова = ИсточникВызоваФормы(ВладелецФормы, 0);
	Если ИсточникВызова <> Неопределено Тогда
		ТипИсточника = ТипЗнч(ИсточникВызова);
		Если ТипИсточника = Тип("СправочникСсылка.КомпетенцииПерсонала") Тогда
			Элементы.КомпетенцииГруппа.Видимость = Ложь;
		ИначеЕсли ТипИсточника = Тип("СправочникСсылка.ДействияСотрудников") Тогда
			Элементы.ФункцииГруппа.Видимость = Ложь;
		ИначеЕсли ТипИсточника = Тип("СправочникСсылка.ГруппыХарактеристикПерсонала") Тогда
			Элементы.ГруппыХарактеристик.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ИсточникВызоваФормы(РодительскаяФорма, Вложенность)
	
	Если Вложенность > 3 Тогда
		Возврат Неопределено;
	Иначе
		Вложенность = Вложенность + 1;
	КонецЕсли;
	
	ТипФормы = ТипЗнч(РодительскаяФорма);
	Если ТипФормы = Тип("ТаблицаФормы") Тогда
		ОбъектФормы = ИсточникВызоваФормы(РодительскаяФорма.Родитель, Вложенность);
	ИначеЕсли ТипФормы = Тип("ФормаКлиентскогоПриложения") Тогда
		Если РодительскаяФорма.Параметры.Свойство("Ключ") Тогда
			ОбъектФормы = РодительскаяФорма.Параметры.Ключ;
		ИначеЕсли СтрНачинаетсяС(РодительскаяФорма.ИмяФормы, "ПланВидовХарактеристик.ХарактеристикиПерсонала.") Тогда
			ОбъектФормы = ИсточникВызоваФормы(РодительскаяФорма.ВладелецФормы, Вложенность);
		Иначе
			ОбъектФормы = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбъектФормы;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьДоступностьЦелейРазвития(ТекущийОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиОбученияРазвития = РегистрыСведений.НастройкиОбученияРазвития.ЗначенияНастроек();
	ВидимостьЦелейРазвития = НастройкиОбученияРазвития.ИспользоватьЦелиРазвитияСотрудников;
	УстановитьПривилегированныйРежим(Ложь);
	
	ЧтениеЦелейРазвития = ПравоДоступа("Чтение", Метаданные.Справочники.ЦелиРазвития);
	ИзменениеЦелейРазвития = ПравоДоступа("Изменение", Метаданные.Справочники.ЦелиРазвития);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЦелиРазвитияГруппа", "Видимость", ВидимостьЦелейРазвития И ЧтениеЦелейРазвития);
	
	Если ВидимостьЦелейРазвития И ЧтениеЦелейРазвития Тогда
		ЗаполнитьЦелиРазвития(ТекущийОбъект);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЦелиРазвития", "ТолькоПросмотр", Не ИзменениеЦелейРазвития);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЦелиРазвитияПодборЦелей", "Доступность", ИзменениеЦелейРазвития);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокСпискаМероприятий()
	
	ЗначениеХарактеристики = СписокМероприятий.Параметры.Элементы.Найти("Характеристика");
	Если ЗначениеХарактеристики = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СписокМероприятий.ТекстЗапроса;
	Запрос.УстановитьПараметр("Характеристика", ЗначениеХарактеристики.Значение);
	Для Каждого ПараметрЗапроса Из СписокМероприятий.Параметры.Элементы Цикл
		ИмяПараметра = СписокМероприятий.Параметры.ДоступныеПараметры.НайтиПараметр(ПараметрЗапроса.Параметр);
		Запрос.УстановитьПараметр(ИмяПараметра, ПараметрЗапроса.Значение);
	КонецЦикла;
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		КоличествоМероприятий = Результат.Выгрузить().Количество();
	Иначе
		КоличествоМероприятий = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
